
#Область ПрограммныйИнтерфейс

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
//
// Параметры:
//  КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//  Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//  ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенногоВида = "СправочникКлиенты";
	Элемент.ЭтоГруппа = Истина;
	Элемент.Наименование = НСтр("ru = 'Контактная информация справочника ""Клиенты""'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Используется = Истина;
	
	// Телефон Клиента
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенногоВида = "ТелефонКлиента";
	Элемент.Родитель = "СправочникКлиенты";
	Элемент.ИмяГруппы = "СправочникКлиенты";
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Элемент.ИдентификаторДляФормул = "ТелефонКлиента";
	Элемент.ВидРедактирования = "ПолеВвода";
	Элемент.ОтображатьВсегда = Истина;
	Элемент.Наименование = НСтр("ru = 'Телефон'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Используется = Истина;

	// Адрес электроной почты Клиента
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенногоВида = "АдресЭлектроннойПочтыКлиента";
	Элемент.Родитель = "СправочникКлиенты";
	Элемент.ИмяГруппы = "СправочникКлиенты";
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Элемент.ИдентификаторДляФормул = "АдресЭлектроннойПочтыКлиента";
	Элемент.ВидРедактирования = "ПолеВвода";
	Элемент.ОтображатьВсегда = Истина;
	Элемент.Наименование = НСтр("ru = 'Адрес электронной почты'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Используется = Истина;

	// Адрес электроной почты Клиента
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенногоВида = "ТелеграммКлиента";
	Элемент.Родитель = "СправочникКлиенты";
	Элемент.ИмяГруппы = "СправочникКлиенты";
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
	Элемент.ИдентификаторДляФормул = "ТелеграммКлиента";
	Элемент.ВидРедактирования = "ПолеВвода";
	Элемент.ОтображатьВсегда = Истина;
	Элемент.Наименование = НСтр("ru = 'Телеграмм'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Используется = Истина;
	
КонецПроцедуры

#КонецОбласти
