
#Область ПрограммныйИнтерфейс

// Перевести пользователей из предыдущей версии.
Процедура ПеревестиПользователейИзПредыдущейВерсии() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	па_Пользователи.Ссылка,
	|	па_Пользователи.Наименование,
	|	па_Пользователи.ИдентиФикаторПользователяИБ
	|ИЗ
	|	Справочник.па_Пользователи КАК па_Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО па_Пользователи.ИдентиФикаторПользователяИБ = Пользователи.ИдентификаторПользователяИБ
	|ГДЕ
	|	Пользователи.Ссылка ЕСТЬ NULL
	|	И па_Пользователи.ИдентиФикаторПользователяИБ <> &ПустойИД";	
	Запрос.УстановитьПараметр("ПустойИД", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			СпрОбъект = Справочники.Пользователи.СоздатьЭлемент();
			СпрОбъект.Наименование = Выборка.Наименование;
			СпрОбъект.ИдентификаторПользователяИБ = Выборка.ИдентификаторПользователяИБ;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СпрОбъект);
			
			НазначитьПрофилиГруппДоступа(СпрОбъект.Ссылка, Выборка.ИдентификаторПользователяИБ);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
					
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НазначитьПрофилиГруппДоступа(Пользователь, ИдентификаторПользователяИБ)
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
	
	Если ПользовательИБ = Неопределено Тогда
		
		Возврат;

	КонецЕсли;
	
	ЭтоАдминистратор = Ложь;
	ЭтоКассир = Ложь;
	ЭтоОператор = Ложь;
	
	Для Каждого Роль Из ПользовательИБ.Роли Цикл
		
		Если Роль = Метаданные.Роли.па_ПолныеПрава Тогда
			
			ЭтоАдминистратор = Истина;
			
		ИначеЕсли Роль = Метаданные.Роли.Кассир Тогда
			
			ЭтоКассир = Истина;
			
		ИначеЕсли Роль = Метаданные.Роли.ОператорАттракциона Тогда
			
			ЭтоОператор = Истина;
			
		КонецЕсли;
		
	КонецЦикла; 
		
	Если ЭтоАдминистратор Тогда
		
		УправлениеДоступом.ВключитьПрофильПользователю(Пользователь, "Администратор");
		
	ИначеЕсли ЭтоКассир Тогда
		
		УправлениеДоступом.ВключитьПрофильПользователю(Пользователь, "Кассир");
		
	ИначеЕсли ЭтоОператор Тогда
		
		УправлениеДоступом.ВключитьПрофильПользователю(Пользователь, "ОператорАттракциона");
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
