#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПеренестиФотоВПрисоединенныеФайлы(ПараметрыОбработки) Экспорт
	
	ПараметрыОбработки.ОбработкаЗавершена = Ложь;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 50
	|	Аттракционы.Ссылка
	|ИЗ
	|	Справочник.Аттракционы КАК Аттракционы
	|ГДЕ
	|	Аттракционы.ФотоПеренесено = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ДанныеФото = СпрОбъект.УдалитьФото.Получить();
			
			Если ДанныеФото <> Неопределено Тогда
				ПеренестиФотоВПрисоединенныйФайл(СпрОбъект);
			КонецЕсли;
			
			СпрОбъект.ФотоПеренесено = Истина;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПеренестиФотоВПрисоединенныйФайл(СпрОбъект)
	
	Спр
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли