#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеВидимостью()
	ЭтоПосещение = (Объект.ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидНоменклатуры.ПосещениеАттракциона"));
	Элементы.ВидАттракциона.Видимость = ЭтоПосещение;
	Элементы.КоличествоПосещений.Видимость = ЭтоПосещение;
КонецПроцедуры

#КонецОбласти
