
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сформировать на сервере.
&НаСервере
Процедура СформироватьНаСервере()
	
	ДиаграммаГанта.Очистить();
	
	Серия = ДиаграммаГанта.Серии.Добавить();
	Серия.Значение = "Отсутствия";
	Серия.Текст = "Отсутствие";
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ПлановыеОтсутствия.Сотрудник КАК Сотрудник,
	|	ПлановыеОтсутствия.ДатаНачала,
	|	ПлановыеОтсутствия.ДатаОкончания,
	|	ПлановыеОтсутствия.Сотрудник.Представление,
	|	ПлановыеОтсутствия.Регистратор
	|ИЗ
	|	РегистрСведений.ПлановыеОтсутствия КАК ПлановыеОтсутствия
	|ГДЕ
	|	ПлановыеОтсутствия.ДатаНачала < &ДатаК
	|	И ПлановыеОтсутствия.ДатаОкончания > &ДатаН
	|ИТОГИ
	|ПО
	|	Сотрудник";
	Запрос.УстановитьПараметр("ДатаН", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаК", Период.ДатаОкончания);
	ВыборкаС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаС.Следующий() Цикл
		
		Точка = ДиаграммаГанта.Точки.Добавить();
		Точка.Значение = ВыборкаС.Сотрудник;
		Точка.Текст = ВыборкаС.СотрудникПредставление;
		
		Выборка = ВыборкаС.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
			Значение.Добавить();
			
			Интервал = Значение.Добавить();
			Интервал.Начало = Выборка.ДатаНачала;
			Интервал.Конец = Выборка.ДатаОкончания;
			Интервал.Расшифровка = Выборка.Регистратор;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(Период.ДатаНачала, Период.ДатаОкончания);
	
КонецПроцедуры

#КонецОбласти
