///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет разделы, в которых доступна команда вызова дополнительных обработок.
// В разделы необходимо добавить метаданные тех разделов,
// в которых размещены команды вызова.
// Для начальной страницы указать ДополнительныеОтчетыИОбработкиКлиентСервер.ИмяНачальнойСтраницы.
//
// Параметры:
//   Разделы - Массив из ОбъектМетаданных - метаданные раздела (подсистемы).
//           - Массив из Строка - для начальной страницы.
//
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	ДополнитьМассивРазделовСДополнительнымиОтчетамиОбработками(Разделы);
	
КонецПроцедуры

// Определяет разделы, в которых доступна команда вызова дополнительных отчетов.
// В Разделы необходимо добавить метаданные тех разделов, 
// в которых размещены команды вызова.
// Для начальной страницы указать ДополнительныеОтчетыИОбработкиКлиентСервер.ИмяНачальнойСтраницы.
//
// Параметры:
//   Разделы - Массив из ОбъектМетаданных - метаданные раздела (подсистемы).
//           - Массив из Строка - для начальной страницы.
//
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	
	ДополнитьМассивРазделовСДополнительнымиОтчетамиОбработками(Разделы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьМассивРазделовСДополнительнымиОтчетамиОбработками(Разделы)

	ИменаДобавляемыхПодсистем = Новый Массив;
	ИменаДобавляемыхПодсистем.Добавить("Продажи");
	ИменаДобавляемыхПодсистем.Добавить("Посещения");
	ИменаДобавляемыхПодсистем.Добавить("Персонал");
	ИменаДобавляемыхПодсистем.Добавить("Справочники");
	ИменаДобавляемыхПодсистем.Добавить(ДополнительныеОтчетыИОбработкиКлиентСервер.ИмяНачальнойСтраницы());

	Для Каждого ИмяПодсистемы Из ИменаДобавляемыхПодсистем Цикл
		ПроверитьДобавитьПодсистемуПоИмениВСписокДоступныхРазделов(Разделы, ИмяПодсистемы);
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьДобавитьПодсистемуПоИмениВСписокДоступныхРазделов(Разделы, ИмяПодсистемы)

  Если Метаданные.Подсистемы.Найти(ИмяПодсистемы) = Неопределено Тогда
  	Разделы.Добавить(ИмяПодсистемы);
//    ТекстСообщения = "Не найдена подсистема по имени """ + ИмяПодсистемы + """
//    |<ОбщийМодуль.ДополнительныеОтчетыИОбработкиПереопределяемый.ПроверитьДобавитьПодсистемуПоИмениВСписокДоступныхРазделов>";
//    ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
    Возврат;
  КонецЕсли;

  Если Разделы.Найти(Метаданные.Подсистемы[ИмяПодсистемы]) = Неопределено Тогда
    Разделы.Добавить(Метаданные.Подсистемы[ИмяПодсистемы]);
  КонецЕсли;

КонецПроцедуры

#КонецОбласти