
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
  // СтандартныеПодсистемы.РаботаСФайлами
    // Для отображения гиперссылки
  ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
  РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
  // Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

  // СтандартныеПодсистемы.РаботаСФайлами
  РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
  // Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
  // СтандартныеПодсистемы.РаботаСФайлами
  РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
  // Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
