
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ДополнительнаяОбработкаСсылка) Тогда
		
		Настройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ДополнительнаяОбработкаСсылка,
			"ХранилищеНастроек").Получить();
		
		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
			КаталогХраненияФайлов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "КаталогХраненияФайлоы");
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)

	Если Не ЗначениеЗаполнено(Параметры.ДополнительнаяОбработкаСсылка) Тогда
		ПредупреждениеАсинх(НСтр("ru = 'Для сохранения настроек форму необходимо открыть из справочника Дополнительные отчеты и обработки'"));
		Возврат;
	КонецЕсли;

	СохранитьНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНаСервере()
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Но
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
		
	
	СпрОбъект = Параметры.ДополнительнаяОбработкаСсылка.ПолучитьОбъект();
	
	Настройки = Новый Структура("КаталогХраненияФайлов", КаталогХраненияФайлов);
	СпрОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(Настройки);
	СпрОбъект.Записать();	
	
КонецПроцедуры

#КонецОбласти
