
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПереходНаВерсию1102(Команда)
	ПереходНаВерсию1102НаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПереходНаВерсию1102НаСервере()

	Документы.ПродажаБилета.ПеренестиНоменклатуруВТабличнуюЧасть();
	
КонецПроцедуры

#КонецОбласти
