
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоМесяцаНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Период = Новый СтандартныйПериод();
	Период.Вариант = ВариантСтандартногоПериода.Месяц;
	Период.ДатаНачала = Объект.НачалоМесяца;
	Период.ДатаОкончания = Объект.НачалоМесяца;
	
	ОпОповещения = Новый ОписаниеОповещения("ОбработкаВводаПериода", ЭтотОбъект);
	ДиалогПериод = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериод.Период = Период;
	ДиалогПериод.Показать(ОпОповещения);
	
//	ПоказатьВводДаты(ОпОповещения, Объект.НачалоМесяца,, ЧастиДаты.Дата);	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаВводаПериода(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		Результат = ТекущаяДата();

	КонецЕсли;
	
	Объект.НачалоМесяца = НачалоМесяца(Результат.ДатаНачала);	
		
КонецПроцедуры

#КонецОбласти
