
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоМесяцаНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Период = Новый СтандартныйПериод();
	Период.Вариант = ВариантСтандартногоПериода.Месяц;
	Период.ДатаНачала = Объект.НачалоМесяца;
	Период.ДатаОкончания = Объект.НачалоМесяца;
	
	ОпОповещения = Новый ОписаниеОповещения("ОбработкаВводаПериода", ЭтотОбъект);
	ДиалогПериод = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериод.Период = Период;
	ДиалогПериод.Показать(ОпОповещения);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаВводаПериода(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		Результат = ТекущаяДата();

	КонецЕсли;
	
	Объект.НачалоМесяца = НачалоМесяца(Результат.ДатаНачала);	
		
КонецПроцедуры

#КонецОбласти
