
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	Объект.БаллыКСписанию = Объект.ПозицииПродажи.Итог("Сумма") - Объект.СуммаДокумента;
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	КлиентПриИзмененииНаСервере();
	РассчитатьСумму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииПродажи

&НаКлиенте
Процедура ПозицииПродажиНоменклатураПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ПозицииПродажи.ТекущиеДанные;
	ТекСтрока.Цена = ЦенаНоменклатуры(ТекСтрока.Номенклатура, Объект.Дата);
	РассчитатьСуммуСтроки(ТекСтрока);
	РассчитатьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.ПозицииПродажи.ТекущиеДанные;
	РассчитатьСуммуСтроки(ТекСтрока);
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.ПозицииПродажи.ТекущиеДанные;
	РассчитатьСуммуСтроки(ТекСтрока);
	РассчитатьСумму();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЦенаНоменклатуры(Номенклатура, Дата)
	Возврат РегистрыСведений.ЦеныНоменклатуры.ЦенаНоменклатуры(Номенклатура, Дата);
КонецФункции

&НаКлиенте
Процедура РассчитатьСумму()	
	Объект.СуммаДокумента = Объект.ПозицииПродажи.Итог("Сумма") - Объект.БаллыКСписанию;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(СтрокаТЧ)
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда

			МоментВремени = Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
			
		Иначе
			
			МоментВремени = ТекущаяДатаСеанса();
			
		КонецЕсли;

		Объект.БаллыКСписанию = Документы.ПродажаБилета.ОстатокБонусныхБалловКлиентов(Объект.Клиент, МоментВремени);
	
	Иначе
		Объект.БаллыКСписанию = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
