
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура БаллыКСписаниюПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	КлиентПриИзменениинаСервере();
	РассчитатьСумму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура("Номенклатура", ТекДанные.Номенклатура);
	
	СтрокиТЗ = ПозицииПродажи.НайтиСтроки(Отбор);
	
	Если СтрокиТЗ.Количество() = 0 Тогда
		СтрокаТЗ = ПозицииПродажи.Добавить();
		СтрокаТЗ.Номенклатура = ТекДанные.Номенклатура;
		СтрокаТЗ.Цена = ТекДанные.Цена;
	Иначе
		СтрокаТЗ = СтрокиТЗ[0];
	КонецЕсли;
	
	СтрокаТЗ.Количество = СтрокаТЗ.Количество + 1;
	
	РассчитатьСуммуСтроки(СтрокаТЗ);
			
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииПродажи
&НаКлиенте
Процедура ПозицииПродажиЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуСтроки(Элементы.ПозицииПродажи.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуСтроки(Элементы.ПозицииПродажи.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(СтрокаТЗ)
	СтрокаТЗ.Сумма = СтрокаТЗ.Цена * СтрокаТЗ.Количество;
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСумму()
	СуммаИтого = ПозицииПродажи.Итог("Сумма") - БаллыКСписанию;
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзменениинаСервере()

	Если ЗначениеЗаполнено(Клиент) Тогда
		
		БаллыКСписанию = Документы.ПродажаБилета.ОстатокБонусныхБалловКлиентов(Клиент, ТекущаяДатаСеанса());
	
	Иначе
		БаллыКСписанию = 0;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
