
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура БаллыКСписаниюПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	КлиентПриИзменениинаСервере();
	РассчитатьСумму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	СтрПар = Новый Структура("Номенклатура, Цена");
	ЗаполнитьЗначенияСвойств(СтрПар, ТекДанные);
	ДобавитьНоменклатуру(СтрПар);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные.ЭтоГруппа Тогда
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;
	
//	Для Каждого ТекСтрока Из Элемент.ВыделенныеСтроки Цикл
//	
//		а = 1;
//		
//	КонецЦикла;
	ПараметрыПеретаскивания.Значение = Новый Структура("Номенклатура, Цена");
	ЗаполнитьЗначенияСвойств(ПараметрыПеретаскивания.Значение, ТекДанные);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииПродажи

&НаКлиенте
Процедура ПозицииПродажиЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуСтроки(Элементы.ПозицииПродажи.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуСтроки(Элементы.ПозицииПродажи.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
//	Для Каждого ЭлНоменклатура Из ПараметрыПеретаскивания.Значение Цикл
//		ЦенаНоменклатуры = ЦенаНоменклатуры(ЭлНоменклатура);
//		
//		ПараметрыДобавления = Новый Структура("Номенклатура, Цена", ЭлНоменклатура, ЦенаНоменклатуры);
		ДобавитьНоменклатуру(ПараметрыПеретаскивания.Значение);
		
//	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиНоменклатураПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ПозицииПродажи.ТекущиеДанные;
	ТекСтрока.Цена = ЦенаНоменклатуры(ТекСтрока.Номенклатура);
	РассчитатьСуммуСтроки(ТекСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьПродажу(Команда)
	
	ОчиститьСообщения();
	
	НовыйДокумент = ЗаписатьПродажуНаСервере();
	
	ОповеститьОбИзменении(НовыйДокумент);
	
	ПоказатьОповещениеПользователя("Создан документ",
		ПолучитьНавигационнуюСсылку(НовыйДокумент) ,
		Строка(НовыйДокумент));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЦенаНоменклатуры(Номенклатура)
	Возврат РегистрыСведений.ЦеныНоменклатуры.ЦенаНоменклатуры(Номенклатура);
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(СтрокаТЗ)
	СтрокаТЗ.Сумма = СтрокаТЗ.Цена * СтрокаТЗ.Количество;
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСумму()
	СуммаИтого = ПозицииПродажи.Итог("Сумма") - БаллыКСписанию;
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзменениинаСервере()

	Если ЗначениеЗаполнено(Клиент) Тогда
		
		БаллыКСписанию = Документы.ПродажаБилета.ОстатокБонусныхБалловКлиентов(Клиент, ТекущаяДатаСеанса());
	
	Иначе
		БаллыКСписанию = 0;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуру(Параметры)

	Отбор = Новый Структура("Номенклатура", Параметры.Номенклатура);
	
	СтрокиТЗ = ПозицииПродажи.НайтиСтроки(Отбор);
	
	Если СтрокиТЗ.Количество() = 0 Тогда
		СтрокаТЗ = ПозицииПродажи.Добавить();
		СтрокаТЗ.Номенклатура = Параметры.Номенклатура;
		СтрокаТЗ.Цена = Параметры.Цена;
	Иначе
		СтрокаТЗ = СтрокиТЗ[0];
	КонецЕсли;
	
	СтрокаТЗ.Количество = СтрокаТЗ.Количество + 1;
	
	РассчитатьСуммуСтроки(СтрокаТЗ);
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьПродажуНаСервере()
	ДокОбъект = Документы.ПродажаБилета.СоздатьДокумент();
	ДокОбъект.Заполнить(Неопределено);
	ДокОбъект.Дата = ТекущаяДатаСеанса();
	ДокОбъект.Клиент = Клиент;
	ДокОбъект.СуммаДокумента = СуммаИтого;
	ДокОбъект.БаллыКСписанию = БаллыКСписанию;	
	ДокОбъект.ПозицииПродажи.Загрузить(ПозицииПродажи.Выгрузить());
	
	Если Не ДокОбъект.ПроверитьЗаполнение() Тогда
		ВызватьИсключение "Не удалось записать продажу"
	КонецЕсли;
	
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ДокОбъект.Ссылка;
КонецФункции

#КонецОбласти
