
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ОснованиеПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&Насервере
Процедура ОснованиеПриИзмененииНаСервере()
	Объект.Аттракцион = Объект.Основание.Аттракцион;
КонецПроцедуры

#КонецОбласти
