#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПеренестиТелефонВТабличнуюЧасть(ПараметрыОбработки) Экспорт
	
	ПараметрыОбработки.ОбработкаЗавершена = Ложь;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Клиенты.Ссылка,
	|	Клиенты.УдалитьТелефон
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.УдалитьТелефон <> """"";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ПараметрыОбработки.ОбработкаЗавершена = Истина;
		Возврат;
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
//	СпрОбъект = Справочники.Клиенты.СоздатьЭлемент();
			СтрокаТЧ = СпрОбъект.КонтактнаяИнформация.Добавить();
			СтрокаТЧ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКлиента;
			СтрокаТЧ.ВидДляСписка = СтрокаТЧ.Вид;
			СтрокаТЧ.Значение = Выборка.Телефон;

			СпрОбъект.Телефон = "";
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли