
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВидКИ = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("ТелефонКлиента");
	
	Если ЗначениеЗаполнено(ВидКИ)Тогда
		
		СтрокиТЧ = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", ВидКИ));
		
		Если СтрокиТЧ.Количество() > 0 Тогда
			
			ТелефонКИ = СтрокиТЧ[0].Представление;
			НормализованныйТелефон = НомераТелефоновКлиентСервер.НормализованныйНомерТелефона(ТелефонКИ, Истина);
			СтрокиТЧ[0].Представление = НормализованныйТелефон;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
