#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Адрес = ВыгрузитьСервер();

	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
	ПолучитьФайлССервераАсинх(Адрес, "export.zip", ПараметрыДиалога);
	
//	ДлительнаяОперация = НачатьВыгрузкуНаСервере(УникальныйИдентификатор);
//	
//	ОпОповещения = Новый ОписаниеОповещения("ВыгрузкаЗавершение", ЭтотОбъект);
//	ОповещениеОПрогрессе = Новый ОписаниеОповещения("ВыгрузкаОповещениеОПрогрессе", ЭтотОбъект);
//	
//	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
////	ПараметрыОжидания.Заголовок = НСтр("ru = 'Выгрузка аттракционов'");
////	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Формируем архив...'");
//	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
//	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
//	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессе;
//
//	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОпОповещения, ПараметрыОжидания);
//	
//	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОжидание;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгрузитьСервер()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Возврат ПоместитьВоВременноеХранилище(ОбработкаОбъект.ПодготовитьАрхив());
	
КонецФункции

//&НаКлиенте
//Процедура ВыгрузкаОповещениеОПрогрессе(Результат, ДопПараметры) Экспорт
//	
//	ПрогрессДлительнойОперации = Результат.Прогресс.Текст;
//	ПроцентВыполнения = Результат.Прогресс.Процент;
//	
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ВыгрузкаЗавершение(Результат, ДопПараметры) Экспорт
//	
//	Если Результат = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если Результат.Статус = "Ошибка" Тогда
//		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
//		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНачало;
//		Возврат;
//	КонецЕсли;
//	
//	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЗавершение;
//	
//	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
//	ПолучитьФайлССервераАсинх(Результат.АдресРезультата, "export.zip", ПараметрыДиалога);
//	
//КонецПроцедуры
//
//&НаСервереБезКонтекста
//Функция НачатьВыгрузкуНаСервере(УИд)
//	
//	ИмяМетода = "Обработки.ВыгрузкаНаСайт.ПодготовитьАрхив";
//	
//	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УИд);
//	
//	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяМетода);
//	
//КонецФункции

#КонецОбласти
