#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДополнительнаяОбработкаСсылка = Параметры.ДополнительнаяОбработкаСсылка;
	Элементы.ГруппаОтладка.Видимость = (Не ЗначениеЗаполнено(ДополнительнаяОбработкаСсылка));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ВыгрузитьНаСервере();
//	Адрес = ВыгрузитьСервер();
//
//	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
//	ПолучитьФайлССервераАсинх(Адрес, "export.zip", ПараметрыДиалога);
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ДополнительнаяОбработкаСсылка) Тогда
		
		ПредупреждениеАсинх(НСтр("ru = 'Не выбран элемент справочника для сохранения настроек'"));
		Возврат;
		
	КонецЕсли;
	
	ПарФормы = Новый Структура("ДополнительнаяОбработкаСсылка", ДополнительнаяОбработкаСсылка);
	ОткрытьФорму("ВнешняяОбработка.ВыгрузкаНаСайт.Форма.НастройкаВыгрузки", ПарФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыгрузитьНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ИдКоманды = ОбработкаОбъект.ИдентификаторКомандыВыгрузкаАрхиваПоРасписанию();
	ПарВыполнения = Новый Структура("ДополнительнаяОбработкаСсылка", ДополнительнаяОбработкаСсылка);
	ОбработкаОбъект.ВыполнитьКоманду(ИдКоманды, ПарВыполнения);
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьСервер()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Возврат ПоместитьВоВременноеХранилище(ОбработкаОбъект.ПодготовитьАрхив());
	
КонецФункции

#КонецОбласти
